// Задание 2.

/*
Написать функцию, которая принимает в качестве аргументов строку и объект, а затем проверяет есть ли 
у переданного объекта свойство с данным именем. Функция должна возвращать true или false.
*/

let obj = {
    key1: 'value1',
    key2: 'value2',
    key3: 'value3'
};

let str = 'string';

function fun(str, obj) {
    let name = obj.hasOwnProperty('key2');
    console.log(name);
}

fun(str, obj);

//====================================================================================================